## Terragrunt Execution for `./integration/terragrunt/`

<details>
  <summary>1 to add, 0 to change, 0 to destroy</summary>

  ```diff
  time=2023-04-04T20:33:41Z level=debug msg=Did not find any locals block: skipping evaluation.
  time=2023-04-04T20:33:41Z level=debug msg=Running command: terraform --version prefix=[integration/terragrunt]
  time=2023-04-04T20:33:41Z level=debug msg=Terraform version: 1.4.4
  time=2023-04-04T20:33:41Z level=debug msg=Reading Terragrunt config file at integration/terragrunt/terragrunt.hcl
  time=2023-04-04T20:33:41Z level=debug msg=Did not find any locals block: skipping evaluation.
  time=2023-04-04T20:33:41Z level=debug msg=Did not find any locals block: skipping evaluation.
  time=2023-04-04T20:33:41Z level=debug msg=git show-toplevel result:
  
  
  
  time=2023-04-04T20:33:41Z level=warning msg=No double-slash (//) found in source URL /github/workspace/integration/module. Relative paths in downloaded Terraform code may not work.
  time=2023-04-04T20:33:41Z level=debug msg=Downloading Terraform configurations from file:///github/workspace/integration/module into /github/workspace/integration/terragrunt/.terragrunt-cache/P4mMjBlpeiwvbFGwqx-7YAXBRgk/zWXEH7G8yEsAu7Tf4UZFL9vW52w
  time=2023-04-04T20:33:41Z level=debug msg=Copying files from ./integration/terragrunt/ into /github/workspace/integration/terragrunt/.terragrunt-cache/P4mMjBlpeiwvbFGwqx-7YAXBRgk/zWXEH7G8yEsAu7Tf4UZFL9vW52w
  time=2023-04-04T20:33:41Z level=debug msg=Setting working directory to /github/workspace/integration/terragrunt/.terragrunt-cache/P4mMjBlpeiwvbFGwqx-7YAXBRgk/zWXEH7G8yEsAu7Tf4UZFL9vW52w
  time=2023-04-04T20:33:41Z level=debug msg=Running command: terraform init prefix=[integration/terragrunt]
  
  Initializing the backend...
  
  Initializing provider plugins...
  - Finding latest version of hashicorp/local...
  - Installing hashicorp/local v2.4.0...
  - Installed hashicorp/local v2.4.0 (signed by HashiCorp)
  
  Terraform has created a lock file .terraform.lock.hcl to record the provider
  selections it made above. Include this file in your version control repository
  so that Terraform can guarantee to make the same selections by default when
  you run "terraform init" in the future.
  
  Terraform has been successfully initialized!
  
  You may now begin working with Terraform. Try running "terraform plan" to see
  any changes that are required for your infrastructure. All Terraform commands
  should now work.
  
  If you ever set or change modules or backend configuration for Terraform,
  rerun this command to reinitialize your working directory. If you forget, other
  commands will detect it and remind you to do so if necessary.
  time=2023-04-04T20:33:42Z level=debug msg=Copying lock file from /github/workspace/integration/terragrunt/.terragrunt-cache/P4mMjBlpeiwvbFGwqx-7YAXBRgk/zWXEH7G8yEsAu7Tf4UZFL9vW52w/.terraform.lock.hcl to ./integration/terragrunt/ prefix=[integration/terragrunt]
  time=2023-04-04T20:33:42Z level=debug msg=Running command: terraform plan -detailed-exitcode -out /tmp/.-integration-terragrunt-.tfplan -input=false prefix=[integration/terragrunt]
  
  Terraform used the selected providers to generate the following execution
  plan. Resource actions are indicated with the following symbols:
  + create
  
  Terraform will perform the following actions:
  
    # local_file.name will be created
    + resource "local_file" "name" {
  + content              = "hello world"
  + content_base64sha256 = (known after apply)
  + content_base64sha512 = (known after apply)
  + content_md5          = (known after apply)
  + content_sha1         = (known after apply)
  + content_sha256       = (known after apply)
  + content_sha512       = (known after apply)
  + directory_permission = "0777"
  + file_permission      = "0777"
  + filename             = "out.txt"
  + id                   = (known after apply)
  }
  
  Plan: 1 to add, 0 to change, 0 to destroy.
  
  Changes to Outputs:
  + output = "hello"
  
  ─────────────────────────────────────────────────────────────────────────────
  
  Saved the plan to: /tmp/.-integration-terragrunt-.tfplan
  
  To perform exactly these actions, run the following command to apply:
  terraform apply "/tmp/.-integration-terragrunt-.tfplan"
  time=2023-04-04T20:33:42Z level=error msg=Terraform invocation failed in /github/workspace/integration/terragrunt/.terragrunt-cache/P4mMjBlpeiwvbFGwqx-7YAXBRgk/zWXEH7G8yEsAu7Tf4UZFL9vW52w prefix=[integration/terragrunt]
  time=2023-04-04T20:33:42Z level=error msg=1 error occurred:
  * exit status 2
  
  
  
  ```

</details>